### Function

In [1]:
def func(x):
    return x+5

print(func(2))

7

In [2]:
func2 = lambda x: x+5

print(func2(2))

7

In [3]:
func3 = lambda x,y: x+y
print(func3(5,5))

10

---

In [4]:
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

newList = list(map(lambda x: x+5,a))
print(newList)

[6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

In [5]:
newList2 = list(map(lambda x: x%2==0,a))
print(newList2)

[False, True, False, True, False, True, False, True, False, True]

----

In [6]:
import numpy as np
import pandas as pd


df = pd.DataFrame({'value': [1, np.nan, np.nan, 2, 3, 1, 3, np.nan, 3], 'name': ['A','A', 'B','B','B','B', 'C','C','C']})
df

   value name
0    1.0    A
1    NaN    A
2    NaN    B
3    2.0    B
4    3.0    B
5    1.0    B
6    3.0    C
7    NaN    C
8    3.0    C

In [7]:
df.groupby("name").mean()

      value
name
A       1.0
B       2.0
C       3.0

In [8]:
df['value'] = df.groupby("name").transform(lambda x: x.fillna(x.mean()))

In [9]:
df

   value name
0    1.0    A
1    1.0    A
2    2.0    B
3    2.0    B
4    3.0    B
5    1.0    B
6    3.0    C
7    3.0    C
8    3.0    C